{
  "id": "/providers/Microsoft.Authorization/policyDefinitions/67181c0a-6a98-405f-8fad-db76bc6009e5",
  "name": "67181c0a-6a98-405f-8fad-db76bc6009e5",
  "properties": {
    "description": "Description Custom Manual - MCSB Baseline item DP-2 for Storage",
    "displayName": "MCSB Baseline item DP-2 for Storage",
    "metadata": {
      "offeringName": "Storage",
      "offeringId": "c6b94711-f1f5-4e7e-9c89-c17ed4190969",
      "mcsb": {
        "mcsbId": "DP-2",
        "features": [
          {
            "featureId": "DATA_LEAKAGE/LOSS_PREVENTION",
            "featureName": "Data Leakage/Loss Prevention",
            "featureDescription": "Service supports DLP solution to monitor sensitive data movement (in customer's content).",
            "featureSupport": "True",
            "featureGuidance": "Defender for Storage continually analyzes the telemetry stream generated by the Azure Blob Storage and Azure Files services. When potentially malicious activities are detected, security alerts are generated. These alerts are displayed in Microsoft Defender for Cloud, together with the details of the suspicious activity along with the relevant investigation steps, remediation actions, and security recommendations.\r\n\r\nMicrosoft Defender for Storage is built into Microsoft Defender for Cloud. When you enable Microsoft Defender for Cloud's enhanced security features on your subscription, Microsoft Defender for Storage is automatically enabled for all of your storage accounts. You may enable or disable Defender for Storage for individual storage accounts under a specific subscription.",
            "featureReference": "https://docs.microsoft.com/azure/storage/common/azure-defender-storage-configure?tabs=azure-security-center",
            "enabledByDefault": "False",
            "customerActionsDescription": "Monitor anomalies and threats targeting sensitive data"
          }
        ],
        "automatedPolicyAvailability": [
          {
            "policyId": "308fbb08-4ab8-4e67-9b29-592e93fb94fa",
            "policyName": "Microsoft Defender for Storage (Classic) should be enabled",
            "policyDescription": "Microsoft Defender for Storage (Classic) provides detections of unusual and potentially harmful attempts to access or exploit storage accounts.",
            "policyCategory": "Security Center"
          },
          {
            "policyId": "640d2586-54d2-465f-877f-9ffc1d2109f4",
            "policyName": "Microsoft Defender for Storage should be enabled",
            "policyDescription": "Microsoft Defender for Storage detects potential threats to your storage accounts. It helps prevent the three major impacts on your data and workload: malicious file uploads, sensitive data exfiltration, and data corruption. The new Defender for Storage plan includes Malware Scanning and Sensitive Data Threat Detection. This plan also provides a predictable pricing structure (per storage account) for control over coverage and costs.",
            "policyCategory": "Security Center"
          }
        ],
        "frameworkControls": [
          "CIS_Azure_2.0.0_4.2.1",
          "CIS_Azure_2.0.0_2.1.6",
          "CIS_Azure_2.0.0_2.1.4",
          "NIST_SP_800-53_R4_AC-4",
          "NIST_SP_800-53_R4_SI-4"
        ]
      },
      "version": "1.0.0",
      "category": "Regulatory Compliance"
    },
    "mode": "All",
    "policyType": "Custom",
    "policyRule": {
      "if": {
        "allOf": [
          {
            "field": "type",
            "in": [
              "Microsoft.Resources/subscriptions",
              "Microsoft.Resources/subscriptions/resourceGroups"
            ]
          },
          {
            "value": "false",
            "equals": "true"
          }
        ]
      },
      "then": {
        "effect": "Manual",
        "details": {
          "defaultState": "Unknown"
        }
      }
    }
  }
}